sst311212/stm32_soldering_iron_controller/Core/Src/settings.c
  while(ADC_Status != ADC_Idle);
  __disable_irq();
  getSettings()->isSaving = 1;
  configurePWMpin(output_Low);
  __set_PRIMASK(_irq);

#ifdef ENABLE_ADDONS                                                                                      //                                                            ADDONS
  if((save_mode&(save_addons | reset_addons)) == 0){                                                      // No addon save_mode specified
    if( (ChecksumAddons(&flashGlobalSettings.addons) != flashGlobalSettings.addonsChecksum) ||            // Check existing flash data is valid
            (flashGlobalSettings.addons.version) != ADDONS_SETTINGS_VERSION ){
      resetAddonSettings(&flashBufferSettings->addons);                                                   // Load defaults if wrong
      needs_saving=1;
    }
    else
      flashBufferSettings->addons = flashGlobalSettings.addons;                                           // Keep existing addons
  }
  if(save_mode & reset_addons)                                                                            // Reset Addons
    resetAddonSettings(&flashBufferSettings->addons);
  else if(save_mode & save_addons)                                                                        // Save Addons
    flashBufferSettings->addons = *getAddons();

  flashBufferSettings->addonsChecksum = ChecksumAddons(&flashBufferSettings->addons);                     // Update addon checksum
#endif
                                                                                                          //                                                            SYSTEM SETTINGS
  if((save_mode&(save_settings | reset_settings)) == 0){                                                  // No settings save_mode specified
    if( (ChecksumSystemSettings(&flashGlobalSettings.system) != flashGlobalSettings.systemChecksum) ||// Check existing flash data is valid
        (flashGlobalSettings.system.version) != SYSTEM_SETTINGS_VERSION ){
      resetSystemSettings(&flashBufferSettings->system);
      needs_saving=1;
    }                                                // Load defaults if wrong
    else                                                                                                  // Keep existing settings
      flashBufferSettings->system = flashGlobalSettings.system;                                                 // Keep existing data if ok
  }
  if(save_mode & reset_settings){                                                                         // Reset settings
    resetSystemSettings(&flashBufferSettings->system);                                                    // Load defaults
    if(save_mode == reset_all){
      flashBufferSettings->system.version = UINT16_MAX;                                                   // To trigger setup screen
    }
  }
  else if(save_mode & save_settings){                                                                     // Save current settings
    flashBufferSettings->system = *getSystemSettings();
  }
  flashBufferSettings->systemChecksum = ChecksumSystemSettings(&flashBufferSettings->system);             // Update checksum

  for(uint8_t i=0;i<NUM_PROFILES;i++){                                                                    //                                                            PROFILE SETTINGS

    uint8_t bad_data = (ChecksumProfileSettings(&flashGlobalSettings.profile[i]) != flashGlobalSettings.profileChecksum[i]) ||      // check if existing flash data is valid
                        (flashGlobalSettings.profile[i].version != PROFILE_SETTINGS_VERSION);

    if( bad_data || ((save_mode & reset_profile) && (i == profile)) || (save_mode & reset_profiles) ){    // Reset data if wrong, of if resetting profiles.

      resetProfileSettings(&flashBufferSettings->profile[i], i);
      needs_saving=1;
    }
    else{
      if((save_mode & save_profile) &&  (i == profile))
        flashBufferSettings->profile[i] = *getProfileSettings();                                          // Save profile, copy profile settings from system
      else
        flashBufferSettings->profile[i] = flashGlobalSettings.profile[i];                                       // Not saving this profile, backup existing flash profile settings
    }
    flashBufferSettings->profileChecksum[i] = ChecksumProfileSettings(&flashBufferSettings->profile[i]);  // Generate profile checksums
  }

  if(!needs_saving){                                                                                      // Nothing to save, return
    _free(flashBufferSettings);
    getSettings()->isSaving = 0;
    return;
  }

  DBG_SAVE(9);
  eraseFlashPages((uint32_t)&flashGlobalSettings, flashPages_GlobalSettings);
  DBG_SAVE(10);
  writeFlash((uint32_t*)flashBufferSettings, sizeof(flashSettings_t), (uint32_t)&flashGlobalSettings);

  uint32_t flashChecksum, ramChecksum;

  // Check flash and profile have same checksum
  for(uint8_t i=0; i<NUM_PROFILES; i++){
    ramChecksum   = ChecksumProfileSettings(&flashGlobalSettings.profile[i]);
    flashChecksum = ChecksumProfileSettings(&flashGlobalSettings.profile[i]);
    if( (flashChecksum != ramChecksum) ||
        (flashChecksum != flashGlobalSettings.profileChecksum[i])){
       Error_Handler();
    }
  }

  // Check flash and settings buffer have same checksum
  flashChecksum   = ChecksumSystemSettings(&flashGlobalSettings.system);
  ramChecksum     = ChecksumSystemSettings(&flashBufferSettings->system);
  if(flashChecksum != ramChecksum)
     Error_Handler();


#ifdef ENABLE_ADDONS
  // Verify addon crc
  flashChecksum   = ChecksumAddons(&flashGlobalSettings.addons);
  ramChecksum     = ChecksumAddons(&flashBufferSettings->addons);
  if(flashChecksum != ramChecksum)
     Error_Handler();
#endif
  _free(flashBufferSettings);
  DBG_SAVE(0);
  getSettings()->isSaving = 0;

  if(reboot_mode  == do_reboot)
    NVIC_SystemReset();
}

void restoreSettings(void) {
  bool setup = (flashGlobalSettings.system.version == UINT16_MAX);     // 0xFFFF = erased flash, trigger setup mode
#ifndef STM32F072xB
  RCC->APB1ENR |= RCC_APB1ENR_PWREN | RCC_APB1ENR_BKPEN;    // power the BKP peripheral
  PWR->CR      |= PWR_CR_DBP;                               // enable access to the BKP registers
  BKP->CR      = 0u;                                        // disable tamper pin, just to be sure
#else
  RCC->APB1ENR |= RCC_APB1ENR_PWREN;                        // power the BKP peripheral
  RCC->BDCR    |= RCC_BDCR_RTCEN;
  PWR->CR      |= PWR_CR_DBP;                               // enable access to the BKP registers
  RTC->TAFCR   = 0u;                                        // disable tamper pin, just to be sure
#endif

#if (__CORTEX_M == 3)
  uint32_t flashSize = 0xFFFF & *(uint32_t*)FLASHSIZE_BASE; // Some clones report no flash size (0xFFFF), assume these use 1KB sectors.


  if( (flashSize>128) && (flashSize<=1024) )                // Between 256K and 1M (High Density / XL devices), 2KB sectors
    flashPageSize = 2048;

  else                                                      //  Everything else, assume 1KB sectors.
    flashPageSize = 1024;

